var x = {
  "Type": 0,
  "Code": 0,
  "Desc": "查询订单信息成功",
  "Data": {
    "Count": 17,
    "Data": [
      {
        "Id": "s001-20230721-0004",
        "Guid": "9e1f85c4-d6d1-4e21-af45-96c9ceb68f23",
        "ShopCode": "s001",
        "UserId": 50,
        "PayState": 2,
        "OrderState": 3,
        "WorkerState": 0,
        "Amount": "12",
        "RealPayAmount": "12",
        "ExtraOfGoods":
            "[{\"Id\":22,\"Name\":\"热牛乳\",\"Code\":\"011\",\"Sort\":0,\"Image\":\"http://192.168.0.3:9000/rc-resource/goods_list/0be9e98c-5ba8-435c-ba03-81639efcf1ed.jpg\",\"Desc\":\"牛奶简介\\nMleko奶源地位于波兰，那里生长着鲜嫩多汁的优良牧草为奶牛提供自然美味的食物，无添加剂，每一滴牛奶只为保留自然口感奶香浓郁，香醇可口\\n主要原料\\n波兰 mlekovita牛奶 350ml\",\"Price\":\"6\",\"FinalPrice\":\"6\",\"NumberOfSelected\":2,\"Identifier\":\"011:\",\"ItemsZh\":\"\",\"Extra\":{\"Options\":[]}}]",
        "ExtraOfOrder": "{}",
        "ManagerNote": "",
        "OrderNote": "",
        "Remark": "创建订单（普通下单模式）",
        "OperatedBy": "RcApp:11112222333",
        "UpdatedAt": "2023-07-21T23:18:30-04:00",
        "CreatedAt": "2023-07-21T11:18:29-04:00"
      },
    ]
  }
};

List data = [
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已创建",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '去付款'
  },
  {
    '店名': '街角店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },
  {
    '店名': '龙头店',
    '图片地址':
        'https://img0.baidu.com/it/u=3543035106,2121797620&fm=253&app=138&size=w931&n=0&f=JPEG&fmt=auto?sec=1693933200&t=5895b615bc65e4a1db430762726629aa',
    '饮品名字': '拿铁',
    '订单状态': "已支付",
    '价钱': '22',
    '时间': '2023-07-21 06:49:50',
    '付款状态': '显示取餐码'
  },

  // {'店名':'','图片地址':'','订单状态':"已创建",'价钱':'','时间':'','付款状态':''}
];
