var x = [
  [
    {
      '状态': [
        '冰(推荐)',
        '比较烫',
        '温',
      ]
    },
    {
      '冰量': [
        '推荐',
        '少冰',
        '少少冰',
        '去冰',
      ]
    },
    {
      '茶底': [
        '绿妍(推荐)',
        '百岁山(不推荐)',
        '去茶底',
      ]
    },
    {
      '糖量': [
        '正常糖',
        '少糖',
        '少少糖',
        '多糖',
      ]
    },
    {
      '加大料': [
        '八角',
        '话梅',
        '陈皮',
        '桂皮',
      ]
    },
  ],
  [ {
    '状态': ['冰(推荐)', '比较烫', '温'],
  },
    {
      '茶底': [
        '绿妍(推荐)',
        '百岁山(不推荐)',
        '去茶底',
      ],
    },
    {
      '糖量': [
        '正常糖',
        '少糖',
        '少少糖',
        '多糖',
      ],
    },
    {
      "加小料": [
        '红豆',
        '珍珠',
        '青稞',
        '什么冻',
      ],
    },],
  [ {
    '状态': ['冰(推荐)', '比较烫', '温'],
  },
    {
      '茶底': [
        '绿妍(推荐)',
        '百岁山(不推荐)',
        '去茶底',
      ],
    },
    {
      '糖量': [
        '正常糖',
        '少糖',
        '少少糖',
        '多糖',
      ],
    },
    {
      "加小料": [
        '红豆',
        '珍珠',
        '青稞',
        '什么冻',
      ],
    },],
];